Revit 2026 API

# PanelScheduleTemplateSetTableData Method

---

Assigns table data to this template

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetTableData(
	PanelScheduleData Data
)
```
```vb
Public Sub SetTableData (
	Data As PanelScheduleData
)
```
```cpp
public:
void SetTableData(
	PanelScheduleData^ Data
)
```
```fsharp
member SetTableData :
        Data : PanelScheduleData -> unit
```

#### Parameters

Data PanelScheduleData
     The panel schedule data

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

PanelScheduleTemplate Class

Autodesk.Revit.DB.Electrical Namespace